/* REXX */
say "Hello, World!"

x = 10
y = 20
say "x =" x ", y =" y

if x < y then
   say "x is less than y."
else
   say "x is greater than or equal to y."

do i = 1 to 5
   say i
end

sum = x + y
say "Sum of x and y =" sum

exit 0
